; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob8) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 - hoist)
(:init
	(at pallet0 depot0)
	(clear crate4)
	(at pallet1 depot1)
	(clear crate1)
	(at pallet2 depot2)
	(clear crate7)
	(at pallet3 distributor0)
	(clear crate6)
	(at pallet4 distributor1)
	(clear crate0)
	(at pallet5 distributor2)
	(clear crate3)
	(at truck0 depot0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 354)
	(at truck1 distributor2)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 217)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 depot0)
	(available hoist6)
	(at hoist7 distributor2)
	(available hoist7)
	(at hoist8 distributor0)
	(available hoist8)
	(at hoist9 distributor1)
	(available hoist9)
	(at hoist10 distributor0)
	(available hoist10)
	(at crate0 distributor1)
	(on crate0 pallet4)
	(= (weight crate0) 12)
	(at crate1 depot1)
	(on crate1 pallet1)
	(= (weight crate1) 67)
	(at crate2 depot0)
	(on crate2 pallet0)
	(= (weight crate2) 50)
	(at crate3 distributor2)
	(on crate3 pallet5)
	(= (weight crate3) 41)
	(at crate4 depot0)
	(on crate4 crate2)
	(= (weight crate4) 48)
	(at crate5 distributor0)
	(on crate5 pallet3)
	(= (weight crate5) 33)
	(at crate6 distributor0)
	(on crate6 crate5)
	(= (weight crate6) 29)
	(at crate7 depot2)
	(on crate7 pallet2)
	(= (weight crate7) 29)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 crate1)
		(on crate1 pallet1)
		(on crate2 pallet3)
		(on crate3 crate0)
		(on crate4 pallet0)
		(on crate5 crate2)
		(on crate6 pallet2)
		(on crate7 pallet5)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist10 crate6 crate5 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist10) (on crate6 crate5)
   added: (lifting hoist10 crate6) (clear crate5)
   changed: (fuel-cost) from 0 to 1
   goals met: 1 of 8
2. (lift hoist8 crate5 pallet3 distributor0)
   deleted: (at crate5 distributor0) (clear crate5) (available hoist8) (on crate5 pallet3)
   added: (lifting hoist8 crate5) (clear pallet3)
   changed: (fuel-cost) from 1 to 2
   goals met: 1 of 8
3. (lift hoist6 crate4 crate2 depot0)
   deleted: (at crate4 depot0) (clear crate4) (available hoist6) (on crate4 crate2)
   added: (lifting hoist6 crate4) (clear crate2)
   changed: (fuel-cost) from 2 to 3
   goals met: 1 of 8
4. (lift hoist0 crate2 pallet0 depot0)
   deleted: (at crate2 depot0) (clear crate2) (available hoist0) (on crate2 pallet0)
   added: (lifting hoist0 crate2) (clear pallet0)
   changed: (fuel-cost) from 3 to 4
   goals met: 1 of 8
5. (drop hoist6 crate4 pallet0 depot0)
   deleted: (lifting hoist6 crate4) (clear pallet0)
   added: (available hoist6) (at crate4 depot0) (clear crate4) (on crate4 pallet0)
   goals met: 2 of 8
6. (lift hoist5 crate3 pallet5 distributor2)
   deleted: (at crate3 distributor2) (clear crate3) (available hoist5) (on crate3 pallet5)
   added: (lifting hoist5 crate3) (clear pallet5)
   changed: (fuel-cost) from 4 to 5
   goals met: 2 of 8
7. (load hoist5 crate3 truck1 distributor2)
   deleted: (lifting hoist5 crate3)
   added: (in crate3 truck1) (available hoist5)
   changed: (current_load truck1) from 0 to 41
   goals met: 2 of 8
8. (drive truck1 distributor2 distributor1)
   deleted: (at truck1 distributor2)
   added: (at truck1 distributor1)
   changed: (fuel-cost) from 5 to 15
   goals met: 2 of 8
9. (lift hoist4 crate0 pallet4 distributor1)
   deleted: (at crate0 distributor1) (clear crate0) (available hoist4) (on crate0 pallet4)
   added: (lifting hoist4 crate0) (clear pallet4)
   changed: (fuel-cost) from 15 to 16
   goals met: 2 of 8
10. (unload hoist9 crate3 truck1 distributor1)
   deleted: (in crate3 truck1) (available hoist9)
   added: (lifting hoist9 crate3)
   changed: (current_load truck1) from 41 to 0
   goals met: 2 of 8
11. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 16 to 26
   goals met: 2 of 8
12. (load hoist8 crate5 truck0 distributor0)
   deleted: (lifting hoist8 crate5)
   added: (in crate5 truck0) (available hoist8)
   changed: (current_load truck0) from 0 to 33
   goals met: 2 of 8
13. (load hoist10 crate6 truck0 distributor0)
   deleted: (lifting hoist10 crate6)
   added: (in crate6 truck0) (available hoist10)
   changed: (current_load truck0) from 33 to 62
   goals met: 2 of 8
14. (lift hoist2 crate7 pallet2 depot2)
   deleted: (at crate7 depot2) (clear crate7) (available hoist2) (on crate7 pallet2)
   added: (lifting hoist2 crate7) (clear pallet2)
   changed: (fuel-cost) from 26 to 27
   goals met: 2 of 8
15. (drive truck0 distributor0 depot2)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 27 to 37
   goals met: 2 of 8
16. (load hoist2 crate7 truck0 depot2)
   deleted: (lifting hoist2 crate7)
   added: (in crate7 truck0) (available hoist2)
   changed: (current_load truck0) from 62 to 91
   goals met: 2 of 8
17. (unload hoist2 crate6 truck0 depot2)
   deleted: (in crate6 truck0) (available hoist2)
   added: (lifting hoist2 crate6)
   changed: (current_load truck0) from 91 to 62
   goals met: 2 of 8
18. (drive truck0 depot2 depot0)
   deleted: (at truck0 depot2)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 37 to 47
   goals met: 2 of 8
19. (unload hoist6 crate5 truck0 depot0)
   deleted: (in crate5 truck0) (available hoist6)
   added: (lifting hoist6 crate5)
   changed: (current_load truck0) from 62 to 29
   goals met: 2 of 8
20. (drop hoist2 crate6 pallet2 depot2)
   deleted: (lifting hoist2 crate6) (clear pallet2)
   added: (available hoist2) (at crate6 depot2) (clear crate6) (on crate6 pallet2)
   goals met: 3 of 8
21. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 47 to 57
   goals met: 3 of 8
22. (unload hoist5 crate7 truck0 distributor2)
   deleted: (in crate7 truck0) (available hoist5)
   added: (lifting hoist5 crate7)
   changed: (current_load truck0) from 29 to 0
   goals met: 3 of 8
23. (drive truck0 distributor2 depot0)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 57 to 67
   goals met: 3 of 8
24. (drop hoist5 crate7 pallet5 distributor2)
   deleted: (lifting hoist5 crate7) (clear pallet5)
   added: (available hoist5) (at crate7 distributor2) (clear crate7) (on crate7 pallet5)
   goals met: 4 of 8
25. (load hoist4 crate0 truck1 distributor1)
   deleted: (lifting hoist4 crate0)
   added: (in crate0 truck1) (available hoist4)
   changed: (current_load truck1) from 0 to 12
   goals met: 4 of 8
26. (load hoist9 crate3 truck1 distributor1)
   deleted: (lifting hoist9 crate3)
   added: (in crate3 truck1) (available hoist9)
   changed: (current_load truck1) from 12 to 53
   goals met: 4 of 8
27. (drive truck1 distributor1 depot1)
   deleted: (at truck1 distributor1)
   added: (at truck1 depot1)
   changed: (fuel-cost) from 67 to 77
   goals met: 4 of 8
28. (unload hoist1 crate0 truck1 depot1)
   deleted: (in crate0 truck1) (available hoist1)
   added: (lifting hoist1 crate0)
   changed: (current_load truck1) from 53 to 41
   goals met: 4 of 8
29. (drop hoist1 crate0 crate1 depot1)
   deleted: (lifting hoist1 crate0) (clear crate1)
   added: (available hoist1) (at crate0 depot1) (clear crate0) (on crate0 crate1)
   goals met: 5 of 8
30. (unload hoist1 crate3 truck1 depot1)
   deleted: (in crate3 truck1) (available hoist1)
   added: (lifting hoist1 crate3)
   changed: (current_load truck1) from 41 to 0
   goals met: 5 of 8
31. (drop hoist1 crate3 crate0 depot1)
   deleted: (lifting hoist1 crate3) (clear crate0)
   added: (available hoist1) (at crate3 depot1) (clear crate3) (on crate3 crate0)
   goals met: 6 of 8
32. (load hoist0 crate2 truck0 depot0)
   deleted: (lifting hoist0 crate2)
   added: (in crate2 truck0) (available hoist0)
   changed: (current_load truck0) from 0 to 50
   goals met: 6 of 8
33. (load hoist6 crate5 truck0 depot0)
   deleted: (lifting hoist6 crate5)
   added: (in crate5 truck0) (available hoist6)
   changed: (current_load truck0) from 50 to 83
   goals met: 6 of 8
34. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 77 to 87
   goals met: 6 of 8
35. (unload hoist3 crate2 truck0 distributor0)
   deleted: (in crate2 truck0) (available hoist3)
   added: (lifting hoist3 crate2)
   changed: (current_load truck0) from 83 to 33
   goals met: 6 of 8
36. (drop hoist3 crate2 pallet3 distributor0)
   deleted: (lifting hoist3 crate2) (clear pallet3)
   added: (available hoist3) (at crate2 distributor0) (clear crate2) (on crate2 pallet3)
   goals met: 7 of 8
37. (unload hoist3 crate5 truck0 distributor0)
   deleted: (in crate5 truck0) (available hoist3)
   added: (lifting hoist3 crate5)
   changed: (current_load truck0) from 33 to 0
   goals met: 7 of 8
38. (drop hoist3 crate5 crate2 distributor0)
   deleted: (lifting hoist3 crate5) (clear crate2)
   added: (available hoist3) (at crate5 distributor0) (clear crate5) (on crate5 crate2)
   goals met: 8 of 8
